outputs/openfoam_cases/0004/constant/waveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format	ascii;
    class	dictionary;
    object	waveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

seaLevel            1.97;

seaLevelAsReference true;

relaxationNames     ( inlet );

initializationName  init;

inletCoeffs
{
    waveType            irregular;
    spectrum            JONSWAP;
    N                   200;
    Tsoft               24;
    Hs                  5.97;
    Tp                  8.86;
    gamma               3.3;
    depth               14.1;
    direction           ( 1 0 0 );
    spectramValues  nonuniform List<scalar> 
201
(
7.69297e-144
3.56704e-123
5.08784e-106
1.09069e-91
1.20926e-79
1.8309e-69
8.16689e-61
1.98192e-53
...
)
;

    fspectrum       nonuniform List<scalar> 
201
(
0.0277778
0.028847
0.0299161
0.0309848
0.032053
0.0331206
0.0341873
0.035253
...
)
;

    amplitude           nonuniform List<scalar>
    200
    (
        1.95294e-63
        7.3751e-55
        1.07965e-47
        1.13655e-41
        1.39806e-36
        2.95155e-32
        1.45331e-28
        2.13525e-25
...
    );
    frequency           nonuniform List<scalar>
    200
    (
        0.0283124
        0.0293816
        0.0304505
        0.0315189
        0.0325868
        0.0336539
        0.0347201
        0.0357852
...
    );
    phaselag            nonuniform List<scalar>
    200
    (
        1.12089
        2.51125
        1.04677
        1.3328
        0.389154
        0.340234
        1.73206
        0.300068
...
    );
    waveNumber          nonuniform List<vector>
    200
    (
        (0.0152412 0 0)
        (0.0158261 0 0)
        (0.0164119 0 0)
        (0.0169985 0 0)
        (0.0175859 0 0)
        (0.0181741 0 0)
        (0.018763 0 0)
        (0.0193525 0 0)
...
    );

    frequencyAxis
    {
        discretisation      cosineStretchedFrequencyAxis;
        lowerFrequencyCutoff 0.0277778;
        upperFrequencyCutoff 0.25;
        writeSpectrum       true;
    }

    relaxationZone
    {
        relaxationScheme    Spatial;
        relaxationShape     Rectangular;
        beachType           Empty;
        relaxType           INLET;
        startX              ( 0 0 -1 );
        endX                ( 400 0 1 );
        orientation         ( 1 0 0 );
        fieldNames          ( alpha.water U );
    }
}

initCoeffs
{
    waveType            potentialCurrent;
    U                   ( 0 0 0 );
    Tsoft               24;
}



// ************************************************************************* //
