outputs/openfoam_cases/0004/system/surfaceElevationDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    system;
    object      surfaceElevationDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Set output format : choice of
//      xmgr
//      jplot
//      gnuplot
//      raw
setFormat raw;

// interpolationScheme. choice of
//      cell          : use cell-centre value only; constant over cells (default)
//      cellPoint     : use cell-centre and vertex values
//      cellPointFace : use cell-centre, vertex and face values.
// 1] vertex values determined from neighbouring cell-centre values
// 2] face values determined using the current face interpolation scheme
//    for the field (linear, gamma, etc.)
interpolationScheme cellPointFace;

// Fields to sample.
fields
(
    alpha1
    U
    k
);


// Set sampling definition: choice of
//      uniform             evenly distributed points on line
//      face                one point per face intersection
//      midPoint            one point per cell, inbetween two face intersections
//      midPointAndFace     combination of face and midPoint
//
//      curve               specified points, not nessecary on line, uses
//                          tracking
//      cloud               specified points, uses findCell
//
// axis: how to write point coordinate. Choice of
// - x/y/z: x/y/z coordinate only
// - xyz: three columns
//  (probably does not make sense for anything but raw)
// - distance: distance from start of sampling line (if uses line) or
//             distance from first specified sampling point
//
// type specific:
//      uniform, face, midPoint, midPointAndFace : start and end coordinate
//      uniform: extra number of sampling points
//      curve, cloud: list of coordinates
sets
(

 lineVert1
    {
        type        face;
        axis        y;

        start       (-0.565 -2.0 0.0);
        end         (-0.565  3.0 0.0);
        nPoints     100;
    }
    lineVert2
    {
        type        face;
        axis        y;

        start       (6.645 -2.0 0.0);
        end         (6.645  3.0 0.0);
        nPoints     100;
    }

   lineVert3
    {
        type        face;
        axis        y;

        start       (7.365 -2.0 0.0);
        end         (7.365  3.0 0.0);
        nPoints     100;
    }

  lineVert4
    {
        type        face;
        axis        y;

        start       (7.975 -2.0 0.0);
        end         (7.975  3.0 0.0);
        nPoints     100;
    }

  lineVert5
    {
        type        face;
        axis        y;

        start       (8.585 -2.0 0.0);
        end         (8.585  3.0 0.0);
        nPoints     100;
    }

  lineVert6
    {
        type        face;
        axis        y;

        start       (9.195 -2.0 0.0);
        end         (9.195  3.0 0.0);
        nPoints     100;
    }
  lineVert7
    {
        type        face;
        axis        y;

        start       (9.81 -2.0 0.0);
        end         (9.81  3.0 0.0);
        nPoints     100;
    }
  lineVert8
    {
        type        face;
        axis        y;

        start       (10.425 -2.0 0.0);
        end         (10.425  3.0 0.0);
        nPoints     100;
    }
);


// *********************************************************************** //